# Написать программу, которая генерирует в указанных пользователем границах:
# ● случайное целое число,
# ● случайное вещественное число,
# ● случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона.
# Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
# Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.

from random import randint, uniform

print('Введите два целых числа')
int1 = int(input('введите первое целое число: '))
int2 = int(input('введите второе целое число: '))

print('Введите два вещественных числа')
float1 = float(input('введите первое вещественное число: '))
float2 = float(input('введите второе вещественное число: '))

print('Введите два символа')
char1 = input('введите первый символ: ')
char2 = input('введите второй символ: ')

rint = randint(int1, int2)
rfloat = uniform(float1, float2)
rchar = chr(randint(ord(char1), ord(char2)))

print(f'случайное целое число: {rint}')
print(f'случайное вещественное число: {rfloat}')
print(f'случайный символ: {rchar}')
