# Определить, является ли год, который ввел пользователь, високосным или не високосным.

Y = int(input('Введите год: '))

if (Y % 4 == 0 and Y % 100 != 0) or Y % 400 == 0:
    print('Год високосный')
else:
    print('Год не високосный')
