# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

a = int(input('введите трехзначное число: '))

summ = a//100%10 + a//10%10 + a%10
product = a//100%10 * a//10%10 * a%10

print(f'Сумма цифр: {summ} \n'
      f'произведение цифр {product}')