# Пользователь вводит две буквы.
# Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.

print('Введите две буквы')
char1 = input('введите первую букву: ')
char2 = input('введите вторую букву: ')

pos1 = ord(char1) - 96
pos2 = ord(char2) - 96
cnt = pos2 - pos1 - 1

print(f'Позиция первой буквы: {pos1}')
print(f'Позиция второй буквы: {pos2}')
print(f'Количество букв между символами: {cnt}')
