# 3. Дан список, содержащий искаженные данные с должностями и именами сотрудников

spis = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']

for i in spis:
    print(f'Привет, {i.split()[-1].capitalize()}!')
