# Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
# Числа и знак операции вводятся пользователем.
# После выполнения вычисления программа не завершается, а запрашивает новые данные для вычислений.
# Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
# Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),
# программа должна сообщать об ошибке и снова запрашивать знак операции.
# Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел его в качестве делителя.

ex = True
while ex:
    a = float(input('введите первое число: '))
    b = float(input('введите второе число: '))
    zn = input('введите знак операции (+,-,*,/) или 0 для завершения программы: ').strip()

    if zn == '+':
        print(f'{a} + {b} = {a+b}')
    elif zn == '-':
        print(f'{a} - {b} = {a - b}')
    elif zn == '*':
        print(f'{a} * {b} = {a * b}')
    elif zn == '/' and b != 0:
        print(f'{a} / {b} = {a / b}')
    elif zn == '/' and b == 0:
        print('Деление на 0 не возможно')
    elif zn == '0':
        ex = False
    else:
        print('Неверный знак операции')
