# Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,…
# Количество элементов (n) вводится с клавиатуры.

cnt = int(input('введите количество элементов: '))
num = 1
s = ''
zn = 1

while cnt > 0:
    cnt -= 1
    zn *= -1
    s += str(num)

    if cnt > 0:
        s += ', '

    num = abs(num) / 2 * zn

print(s)
