# Напишите программу, доказывающую или проверяющую,
# что для множества натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2, где n — любое натуральное число.

def left(dgt):
    if dgt == 0:
        return dgt
    else:
        return dgt + left(dgt - 1)


num = int(input(f'Введите натуральное число: '))
l = left(num)
r = num*(num + 1)/2

if l == r:
    print('Равенство выполняется')
    print(f'{l} = {r}')
else:
    print('равенство не выполняется')
    print(f'{l} <> {r}')
