# Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
# Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.

def cnt_isk(num, isk):
    cnt = 0

    while num > 0:
        if num % 10 == isk:
            cnt += 1

        num = num // 10

    return cnt


isk = int(input(f'Введите искомую цифру: '))
num = -1
cnt = 0

while num != 0:
    num = int(input(f'Введите натуральное число, для завершения последовательности введите 0: '))

    cnt += cnt_isk(num, isk)

print(f'В последовательности найдено {cnt} искомых цифр')
